src/InformationRegisters/synс_JWT/synс_JWT.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>synс_JWT</name>
  <resources>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Access_token</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Refresh_token</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Expires_in</name>
    <comment>Время действия токена (в секундах)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВладелецСистемы</name>
    <type>
      <types>CatalogRef.synс_SystemOwner</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/synс_ConnectionSettings/synс_ConnectionSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>synс_ConnectionSettings</name>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сервер</name>
    <type>
      <types>CatalogRef.synс_Server</types>
    </type>
  </resources>
  <dimensions>
    <name>Метод</name>
    <type>
      <types>CatalogRef.synс_Methods</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/synс_JWT/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Структура JWT (Json Web Token) — ключ аутентификации пользователя
// 
// Возвращаемое значение:
// СтруктураJWT — структура - 
//
Функция СтруктураJWT(ВладелецСистемы = Неопределено, ДатаЗаписи = Неопределено) Экспорт
	
	ТекущаяДатаЗаписи = ?(ЗначениеЗаполнено(ДатаЗаписи), ДатаЗаписи, ТекущаяДатаСеанса());
	СтруктураJWT = Новый Структура();
	СтруктураJWT.Вставить("ВладелецСистемы", ВладелецСистемы);
	СтруктураJWT.Вставить("ДатаЗаписи", ТекущаяДатаЗаписи);
	СтруктураJWT.Вставить("ДействуетДо", Неопределено);
	СтруктураJWT.Вставить("Access_token", "");
	СтруктураJWT.Вставить("Refresh_token", "");
	СтруктураJWT.Вставить("Expires_in", "");
	
	Возврат СтруктураJWT;
	
КонецФункции 

// Результат записи в базу JWT
//
// Параметры:
//  СтруктураJWT - Структура - см.СтруктураJWT()
// 
// Возвращаемое значение:
//  РезультатЗаписиВБазуJWT - Булево 
//
Функция РезультатЗаписиВБазуJWT(СтруктураJWT) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
	 
		Запись = РегистрыСведений.synс_JWT.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, СтруктураJWT); 
		Запись.Записать();
			
	Исключение
		
		пр_Ошибка = ОписаниеОшибки();
		пр_КлиентСервер.ЗафиксироватьОшибкуDev(пр_Ошибка, "РезультатЗаписиВБазуJWT");
		
	 	Возврат Ложь;
		
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Истина;
		
КонецФункции 

Функция ДанныеJWTПоВладелецуСистемы(ВладелецСистемы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	synс_JWT.ВладелецСистемы КАК ВладелецСистемы,
		|	synс_JWT.ДатаЗаписи КАК ДатаЗаписи,
		|	synс_JWT.ДействуетДо КАК ДействуетДо,
		|	synс_JWT.Access_token КАК Access_token,
		|	synс_JWT.Refresh_token КАК Refresh_token,
		|	synс_JWT.Expires_in КАК Expires_in
		|ИЗ
		|	РегистрСведений.synс_JWT КАК synс_JWT
		|ГДЕ
		|	synс_JWT.ВладелецСистемы = &ВладелецСистемы";
	
	Запрос.УстановитьПараметр("ВладелецСистемы", ВладелецСистемы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат пр_Общий.СтруктураПоЗапросу(РезультатЗапроса);
	
КонецФункции   

Функция AccessTokenПоВладельцуСервиса(ВладелецСистемы)  Экспорт
	
	ДанныеJWT = synс_ОбщегоНазначенияПовтИсп.ДанныеJWTПоВладелецуСистемы(ВладелецСистемы);
	
	//Если он не актуальный получить новый по методу авторизации владельца системы
	Если ДанныеJWT = Неопределено Тогда
		AccessToken = AccessTokenПоМетодуАвторизацииВладельцаСервиса(ВладелецСистемы);
	ИначеЕсли ДанныеJWT.ДействуетДо <= ТекущаяДатаСеанса() Тогда
		AccessToken = AccessTokenПовторнаяАвторизацияВладельцаСервиса(ВладелецСистемы, ДанныеJWT);
	Иначе
		AccessToken = ДанныеJWT.Access_token;
	КонецЕсли; 
	
	Возврат AccessToken;	
	
КонецФункции 

Функция МетодАвторизацииВладельцаСистемы(ВладелецСистемы, ЭтоПовторнаяАвторизация = Ложь)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	synс_ConnectionSettings.Метод КАК МетодАвторизации
		|ИЗ
		|	РегистрСведений.synс_ConnectionSettings КАК synс_ConnectionSettings
		|ГДЕ
		|	synс_ConnectionSettings.Использовать = ИСТИНА
		|	И synс_ConnectionSettings.Метод.Владелец.Владелец = &ВладелецСистемы
		|";
	
	ТекстОтбора = "  И synс_ConnectionSettings.Метод.ЭтоАвторизацияПоЛогинуПаролю = ИСТИНА";
	Если ЭтоПовторнаяАвторизация = Истина Тогда
		ТекстОтбора = "  И synс_ConnectionSettings.Метод.ЭтоАвторизацияПоRefreshToken = ИСТИНА";
	КонецЕсли; 	
	
	Запрос.Текст = Запрос.Текст + ТекстОтбора;
	
	Запрос.УстановитьПараметр("ВладелецСистемы", ВладелецСистемы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВДЗ = РезультатЗапроса.Выбрать();
	
	Если ВДЗ.Следующий() Тогда
		Возврат ВДЗ.МетодАвторизации;	
	Иначе 
		Возврат Неопределено;	
	КонецЕсли; 

КонецФункции 

Функция AccessTokenПоМетодуАвторизацииВладельцаСервиса(ВладелецСистемы, ДанныеJWT = Неопределено)  Экспорт
	
	ЭтоПовторнаяАвторизация = ДанныеJWT <> Неопределено;
	МетодАвторизации = МетодАвторизацииВладельцаСистемы(ВладелецСистемы, ЭтоПовторнаяАвторизация);
	
	Если МетодАвторизации = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	пр_Модуль = пр_Общий.ИсполняемыйМодуль("synс_Methods", пр_НастройкиПовтИсп.ТекущийПользователь()); 
	НастройкиHTTP = пр_Модуль.НастройкиПодключенияHTTPМетода(МетодАвторизации);
	
	Если ЭтоПовторнаяАвторизация = Истина Тогда
		НастройкиHTTP.Тело.refresh_token = ДанныеJWT.Refresh_token;		
	КонецЕсли; 
	
	РезультатВыполнения = пр_Модуль.РезультатВыполненияHTTPМетода(МетодАвторизации, НастройкиHTTP);

	//TODO:  В настройках структура ответа
	data = пр_Общий.ЗначениеРеквизитаОбъектаМожетНеБыть(РезультатВыполнения, "data"); 
	Если data = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	СтруктураJWT = СтруктураJWT(ВладелецСистемы, );
	ЗаполнитьЗначенияСвойств(СтруктураJWT, data); 
	СтруктураJWT.ДействуетДо = СтруктураJWT.ДатаЗаписи + СтруктураJWT.Expires_in - 10;
	
	РезультатЗаписи = РезультатЗаписиВБазуJWT(СтруктураJWT);
	
	Если РезультатЗаписи = Истина Тогда
		Возврат СтруктураJWT.Access_token;
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
КонецФункции 

Функция AccessTokenПоЛогинуПаролюВладельцаСервиса(ВладелецСистемы)  Экспорт
	AccessTokenПоМетодуАвторизацииВладельцаСервиса(ВладелецСистемы);		
КонецФункции 

Функция AccessTokenПовторнаяАвторизацияВладельцаСервиса(ВладелецСистемы, ДанныеJWT)  Экспорт
	AccessTokenПоМетодуАвторизацииВладельцаСервиса(ВладелецСистемы, ДанныеJWT);		
КонецФункции 


#Область ДляВызоваИзДругихПодсистем

#КонецОбласти

#КонецОбласти

#КонецЕсли
